ka2_2024/src/Catalogs/ВидыПрочихДоходовФизическихЛиц/ВидыПрочихДоходовФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПрочихДоходовФизическихЛиц</name>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаСтраховыеВзносы</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКодДоходаСтраховыеВзносы</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначениеПрочихДоходовФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаИсполнительногоПроизводства</name>
    <type>
      <types>EnumRef.ВидыДоходовИсполнительногоПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаРаздела2Расчета6НДФЛ</name>
    <comment>АПК:58</comment>
    <type>
      <types>EnumRef.СтрокиРаздела2Расчета6НДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаИсполнительногоПроизводства2022</name>
    <type>
      <types>EnumRef.ВидыДоходовИсполнительногоПроизводства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Enums/НазначениеПрочихДоходовФизическихЛиц/НазначениеПрочихДоходовФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначениеПрочихДоходовФизическихЛиц</name>
  <enumValues>
    <name>ОбщегоНазначения</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаБывшимВоеннослужащим</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ВидыПрочихДоходовФизическихЛиц/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Назначение = Перечисления.НазначениеПрочихДоходовФизическихЛиц.ОбщегоНазначения;	
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ВыплатыБывшимВоеннослужащим") Тогда 
		МодульВыплатыБывшимВоеннослужащим = ОбщегоНазначения.ОбщийМодуль("ВыплатыБывшимВоеннослужащим");
		МодульВыплатыБывшимВоеннослужащим.ПередЗаписьюВидаПрочихДоходовФизическихЛиц(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КодДоходаНДФЛ				= Справочники.ВидыДоходовНДФЛ.ПустаяСсылка();
	КодДоходаСтраховыеВзносы	= Справочники.ВидыДоходовПоСтраховымВзносам.ПустаяСсылка();
	Назначение					= Перечисления.НазначениеПрочихДоходовФизическихЛиц.ОбщегоНазначения;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Обновляем кэш платформы для зачитывания актуальных настроек
	// используется в ОтражениеЗарплатыВУчетеПовтИсп.ТаблицаНачислениеУдержаниеВидОперации.
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
